zthxxx/STM32-Contiki_Sensor_Smart_Home/User/Contiki-ProcessTask/ProcessTask.h
#ifndef __PROCESS_TASK_H__
#define __PROCESS_TASK_H__
#include "stm32f10x.h"
#include "stm32f10x_conf.h"
#include <string.h>
#include "bsp_gpio.h"
#include "bsp_usart1.h"
#include "bsp_usart2.h"
#include "bsp_SysTick.h"
#include "dma.h"
#include "iwdg.h"
#include "SPI.h"
#include "delay.h"
#include "timers.h"
#include "timer4_cap.h"
#include "NVIC_CONFIG.H"
#include "cJSON.h"
#include "CommunicationProtocol.h"

#include "wifi_config.h"
#include "wifi_function.h"
#include "oled.h"
#include "dht11.h"
#include "adc.h"
#include "MQ-2.h"
#include "HC-SR501.h"
#include "HC-SR04.h"
#include "BH1750.h"
#include "RC522.h"
#include "E30TTLUART.h"
#include "SDS01.h"
#include "SHT15.h"

#include "contiki-conf.h"
#include <stdint.h>
#include <stdio.h>
#include <debug-uart.h>
#include <process.h>
#include <procinit.h>
#include <etimer.h>
#include <autostart.h>
#include <clock.h>
#include "contiki_delay.h"


//在"CommunicationConfig.h"文件中修改 __TERMINAL_XX__宏定义，选择节点或终端模式
#ifdef __TERMINAL_ON__
    #define __SDS01_MODULE_ON__         //SDS01 PM2.5 PM10 传感器模块
    #define __WIFI_MODULE_ON__          //WIFI模块开启
    #define __E30TTLUART_MODULE_ON__    //E30无线串口模块
    #define __COMMUNICAT_PROTOCOL__     //管理发送队列
    #define __COMMUNICAT_PROTOCOL_SENSOR_DATA__  //通过JSON发送所有数据
#else
    #ifdef __TERMINAL_OFF__
    #define __COMMUNICAT_PROTOCOL__     //管理发送队列
    #define __COMMUNICAT_PROTOCOL_SENSOR_DATA__  //通过JSON发送所有数据
    #define __OLED_MODULE_ON__          //OLED显示屏
    #define __DHT11_MODULE_ON__         //温湿度传感器
    #define __MQ02_MODULE_ON__          //烟雾传感器
    #define __HCSR501_MODULE_ON__       //红外热释电人体传感器
    #define __HCSR04_MODULE_ON__        //超声波测距模块
    #define __BH1750_MODULE_ON__        //光照传感器
    #define __RC522_MODULE_ON__         //RFID读卡器
    #define __SDS01_MODULE_ON__         //SDS01 PM2.5 PM10 传感器模块
    #define __SHT15_MODULE_ON__         //SHT15 精确温湿度传感器模块
    #define __E30TTLUART_MODULE_ON__    //E30无线串口模块
    #endif
#endif


PROCESS_NAME(red_blink_process);
PROCESS_NAME(green_blink_process);
PROCESS_NAME(IWDG_Feed_process);
PROCESS_NAME(Communication_Protocol_Send_process);
PROCESS_NAME(clock_test_process);
PROCESS_NAME(cJSON_test_process);
PROCESS_NAME(CommunicatProtocol_Send_Sensor_Data);

PROCESS_NAME(wifi_send_test_process);
PROCESS_NAME(OLED_Show_Increment_process);
PROCESS_NAME(DHT11_Read_Data_process);
PROCESS_NAME(MQ02_Read_Value_process);
PROCESS_NAME(HCSR501_Read_Status_process);
PROCESS_NAME(HCSR04_Measure_Distance_process);
PROCESS_NAME(BH1750_Measure_Lumen_process);
PROCESS_NAME(RC522_Read_Card_process);
PROCESS_NAME(SDS01_Read_PM_Value_process);
PROCESS_NAME(SHT15_Read_DATA_Value_process);



#endif

